In [1]:
import numpy as np
import pandas as pd
# List of Tuples
data1= [('Jack', 34, 'Sydney', 5) ,
        ('Riti', 31, 'Delhi' , 7) ,
        ('Aadi', 46, 'New York', 11)]
# List of Tuples
data2= [('Mohit', 34, 'Tokyo', 11) ,
        ('Veena', 31, 'London' , 10) ,
        ('Shaun', 36, 'Las Vegas', 12)]
# List of Tuples
data3= [('Mark', 47, 'Mumbai',   13) ,
        ('Jose', 43, 'Yokohama', 14) ,
        ('Ramu', 49, 'Paris',    15)]
#Convert data1 , data2 and data3 into DataFrame
df1=pd.DataFrame(data1,index=["a","b","c"],columns=["Name","Age","City","Exp"])
df2=pd.DataFrame(data2,index=["d","e","f"],columns=["Name","Age","City","Exp"])
df3=pd.DataFrame(data3,index=["g","h","i"],columns=["Name","Age","City","Exp"])
print("---------------------------------------")
print("DataFrame-1") 
print(df1)
print("---------------------------------------")
print("DataFrame-2") 
print(df2)
print("---------------------------------------")
print("DataFrame-3") 
print(df3)
print("---------------------------------------")

---------------------------------------
DataFrame-1
   Name  Age      City  Exp
a  Jack   34    Sydney    5
b  Riti   31     Delhi    7
c  Aadi   46  New York   11
---------------------------------------
DataFrame-2
    Name  Age       City  Exp
d  Mohit   34      Tokyo   11
e  Veena   31     London   10
f  Shaun   36  Las Vegas   12
---------------------------------------
DataFrame-3
   Name  Age      City  Exp
g  Mark   47    Mumbai   13
h  Jose   43  Yokohama   14
i  Ramu   49     Paris   15
---------------------------------------

In [5]:
xdf=pd.concat([df1,df2,df3])
print(xdf)

    Name  Age       City  Exp
a   Jack   34     Sydney    5
b   Riti   31      Delhi    7
c   Aadi   46   New York   11
d  Mohit   34      Tokyo   11
e  Veena   31     London   10
f  Shaun   36  Las Vegas   12
g   Mark   47     Mumbai   13
h   Jose   43   Yokohama   14
i   Ramu   49      Paris   15

In [7]:
xdf=pd.concat([df1,df2,df3],axis=0)
print(xdf)

    Name  Age       City  Exp
a   Jack   34     Sydney    5
b   Riti   31      Delhi    7
c   Aadi   46   New York   11
d  Mohit   34      Tokyo   11
e  Veena   31     London   10
f  Shaun   36  Las Vegas   12
g   Mark   47     Mumbai   13
h   Jose   43   Yokohama   14
i   Ramu   49      Paris   15

In [9]:
xdf=pd.concat([df1,df2,df3],axis=1)
print(xdf)#it is not core

   Name   Age      City   Exp   Name   Age       City   Exp  Name   Age  \
a  Jack  34.0    Sydney   5.0    NaN   NaN        NaN   NaN   NaN   NaN
b  Riti  31.0     Delhi   7.0    NaN   NaN        NaN   NaN   NaN   NaN
c  Aadi  46.0  New York  11.0    NaN   NaN        NaN   NaN   NaN   NaN
d   NaN   NaN       NaN   NaN  Mohit  34.0      Tokyo  11.0   NaN   NaN
e   NaN   NaN       NaN   NaN  Veena  31.0     London  10.0   NaN   NaN
f   NaN   NaN       NaN   NaN  Shaun  36.0  Las Vegas  12.0   NaN   NaN
g   NaN   NaN       NaN   NaN    NaN   NaN        NaN   NaN  Mark  47.0
h   NaN   NaN       NaN   NaN    NaN   NaN        NaN   NaN  Jose  43.0
i   NaN   NaN       NaN   NaN    NaN   NaN        NaN   NaN  Ramu  49.0

       City   Exp
a       NaN   NaN
b       NaN   NaN
c       NaN   NaN
d       NaN   NaN
e       NaN   NaN
f       NaN   NaN
g    Mumbai  13.0
h  Yokohama  14.0
i     Paris  15.0